In [1]:
from models.DBManager import DBManager
voc2012path = "C:/Users/antho/Documents/GitHub/data/VOCdevkit/VOC2012/"

In [2]:
manager = DBManager()

In [3]:
train_df, val_df = manager.getTrainValDfClass("C:/Users/antho/Documents/GitHub/data/VOCdevkit/VOC2012/", "aeroplane")

In [4]:
train_df.head()

        imgName      class
5   2008_000033  aeroplane
7   2008_000037  aeroplane
34  2008_000151  aeroplane
47  2008_000197  aeroplane
71  2008_000291  aeroplane

In [5]:
val_df.head()

         imgName      class
5    2008_000021  aeroplane
19   2008_000064  aeroplane
62   2008_000251  aeroplane
89   2008_000367  aeroplane
200  2008_000804  aeroplane

In [4]:
train_df, val_df = manager.getCombinedClassesDf(voc2012path, ["bicycle", "bottle"], "obj")

In [6]:
val_df.head()

         imgName className
28   2008_000090       obj
35   2008_000133       obj
47   2008_000194       obj
114  2008_000466       obj
115  2008_000469       obj